openxc/vi-firmware/cantranslator/libs/CDL/LPC18xxLib/src/lpc18xx_sdio.c
/**********************************************************************
* $Id$		lpc18xx_sdio.c		2011-Dec-07
*//**
* @file		lpc18xx_sdio.c
* @brief	Contains all macro definitions and function prototypes
* 			support for SDIO firmware library on LPC18xx
* @version	1.0
* @date		07. Dec. 2011
* @author	NXP MCU SW Application Team
*
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup SDIO
 * @{
 */

/* Includes ------------------------------------------------------------------- */
#include "LPC18xx.h"                    /* LPC18xx definitions                */
#include "system_LPC18xx.h"
#include "string.h"
#include "lpc_sdmmc.h"
#include "lpc18xx_sdio.h"
#include "lpc18xx_cgu.h"
#include "lpc18xx_timer.h"

/* If this source file built with example, the LPC18xx FW library configuration
 * file in each example directory ("lpc18xx_libcfg.h") must be included,
 * otherwise the default FW library configuration file must be included instead
 */
#ifdef __BUILD_WITH_EXAMPLE__
#include "lpc18xx_libcfg.h"
#else
#include "lpc18xx_libcfg_default.h"
#endif /* __BUILD_WITH_EXAMPLE__ */

#ifdef _SDIO

/* Interrupt Mode has not been implemented, prevent it here! */
#ifndef SDIO_USE_POLLING
#error None Polling Mode has not worked yet!
#endif

/* Global instance of the current card */
static MCI_CARD_INFO_T g_card_info;

#ifdef USE_DMADESC_DBUFF
/* Array of DMA descriptors used for double buffered mode. Must be enough to
   transfer up to 64KBytes in a single DMA session. */
static LPC_SDMMC_DMA_Type mci_dma_dd[1 + (0x10000 / (2 * MCI_DMADES1_MAXTR))];
#else
/* Array of DMA descriptors used for chained mode. Must be enough to transfer
   up to 64KBytes in a single DMA session. */
static LPC_SDMMC_DMA_Type mci_dma_dd[1 + (0x10000 / MCI_DMADES1_MAXTR)];
#endif

/* This must be defined outside the driver and is the rate of the base
   clock going into the SDIO IP */
uint32_t sdio_clk_rate;


/* Private Functions ----------------------------------------------------------- */

int sdio_execute_command(MCI_CARD_INFO_T* pdev,
                         uint32_t cmd,
                         uint32_t arg,
                         uint32_t wait_status);
/*********************************************************************//**
* @brief 		Enables the SDIO controller clock
* @param[in]	None
* @return 		None
**********************************************************************/
static void sdio_enable_clock(void)
{
	/* Enable SD MMC clock */
	CGU_ConfigPWR(CGU_PERIPHERAL_SDIO, ENABLE);
}

/*********************************************************************//**
* @brief 		Disables the SDIO controller clock
* @param[in]	None
* @return 		None
**********************************************************************/
static void sdio_disable_clock(void)
{
	/* Disable SD MMC clock */
	CGU_ConfigPWR(CGU_PERIPHERAL_SDIO, (FunctionalState)FALSE);
}

/*********************************************************************//**
* @brief 		Return clock running status
* @param[in]	None
* @return 		!0 if the clock is enabled, otherwise 0
**********************************************************************/
//int sdio_is_clock_enabled(void)
//{
//	return (LPC_CCU1->CLK_M3_SDIO_CFG & 0x1);
//}

/*********************************************************************//**
* @brief 		Setup DMA descriptors
* @param[in]	addr Address of buffer (source or destination)
* @param[in]	size size of buffer in bytes (64K max)
* @return 		None
**********************************************************************/
void sdio_dma_setup(uint32_t addr, uint32_t size)
{
	int i = 0;
	uint32_t ctrl, maxs;
#ifdef USE_DMADESC_DBUFF
	uint32_t maxs2;
#endif

	/* Reset DMA */
	LPC_SDMMC->CTRL |= MCI_CTRL_DMA_RESET | MCI_CTRL_FIFO_RESET;
 	while (LPC_SDMMC->CTRL & MCI_CTRL_DMA_RESET);

#ifdef USE_DMADESC_DBUFF
	/* Build a descriptor list using the double buffered DMA method */
	while (size > 0) {
		/* Limit size of the transfer to maximum buffer size * 2*/
		maxs = size;
		if (maxs > (MCI_DMADES1_MAXTR * 2))
			maxs = (MCI_DMADES1_MAXTR * 2);
		size -= maxs;

		/* Setup buffer sizes */
		if (maxs > MCI_DMADES1_MAXTR) {
			maxs2 = maxs - MCI_DMADES1_MAXTR;
			maxs = MCI_DMADES1_MAXTR;
		}
		else
			maxs2 = 0;

		/* Set buffer sizes */
		mci_dma_dd[i].des1 = MCI_DMADES1_BS1(maxs) | MCI_DMADES1_BS2(maxs2);

		/* Setup buffer address (double buffered) */
		mci_dma_dd[i].des2 = addr + (i * (MCI_DMADES1_MAXTR * 2));
		mci_dma_dd[i].des3 = mci_dma_dd[i].des2 + maxs;

		/* Setup basic control */
		ctrl = MCI_DMADES0_OWN; // | MCI_DMADES0_DIC;
		if (i == 0)
			ctrl |= MCI_DMADES0_FS; /* First DMA buffer */

		/* No more data? Then this is the last descriptor */
		if (!size)
			ctrl |= MCI_DMADES0_LD;
		else
			ctrl |= MCI_DMADES0_DIC;

		mci_dma_dd[i].des0 = ctrl;

		i++;
	}

	mci_dma_dd[i].des0 = MCI_DMADES0_OWN | MCI_DMADES0_LD;
	mci_dma_dd[i].des1 = 0;
	mci_dma_dd[i].des2 = 0;
	mci_dma_dd[i].des3 = 0;

#else
	/* Build a descriptor list using the chained DMA method */
	while (size > 0) {
		/* Limit size of the transfer to maximum buffer size */
		maxs = size;
		if (maxs > MCI_DMADES1_MAXTR)
			maxs = MCI_DMADES1_MAXTR;
		size -= maxs;

		/* Set buffer size */
		mci_dma_dd[i].des1 = MCI_DMADES1_BS1(maxs);

