openxc/vi-firmware/cantranslator/libs/CDL/LPC18xxLib/src/lpc18xx_sdio.c
		/* Setup buffer address (chained) */
		mci_dma_dd[i].des2 = addr + (i * MCI_DMADES1_MAXTR);

		/* Setup basic control */
		ctrl = MCI_DMADES0_OWN | MCI_DMADES0_CH;
		if (i == 0)
			ctrl |= MCI_DMADES0_FS; /* First DMA buffer */

		/* No more data? Then this is the last descriptor */
		if (!size)
			ctrl |= MCI_DMADES0_LD;
		else
			ctrl |= MCI_DMADES0_DIC;

		/* Another descriptor is needed */
		mci_dma_dd[i].des3 = (uint32_t) &mci_dma_dd[i + 1];
		mci_dma_dd[i].des0 = ctrl;

		i++;
	}
#endif

	/* Set DMA derscriptor base address */
	LPC_SDMMC->DBADDR = (uint32_t) &mci_dma_dd[0];
}

/*********************************************************************//**
* @brief 		Checks whether card is acquired properly or not
* @param[in]	pdev Pointer to card info structure
* @return 		!0 if card has been acquired, otherwise 0
**********************************************************************/
static int prv_card_acquired(MCI_CARD_INFO_T* pdev)
{
  return (pdev->cid[0] != 0);
}

/*********************************************************************//**
* @brief 		Helper function to get a bit field withing multi-word
* 				buffer. Used to get fields with-in CSD & EXT-CSD
* 				structures.
* @param[in]	None
* @return 		None
**********************************************************************/
static uint32_t prv_get_bits(int start, int end, uint32_t* data)
{
  uint32_t v;
  uint32_t i = end >> 5;
  uint32_t j = start & 0x1f;

  if (i == (start >> 5))
    v = (data[i] >> j);
  else
    v = ((data[i] << (32 - j)) | (data[start >> 5] >> j));

  return (v & ((1 << (end - start + 1)) - 1));
}

/*********************************************************************//**
* @brief 		Clears the FIFOs, response and data, and the interrupt status
* @param[in]	None
* @return 		None
**********************************************************************/
static void prv_clear_all(void)
{
  /* reset all blocks */
  LPC_SDMMC->CTRL |= MCI_CTRL_FIFO_RESET;

  /* wait till resets clear */
  while (LPC_SDMMC->CTRL & MCI_CTRL_FIFO_RESET);

  /* Clear interrupt status */
  LPC_SDMMC->RINTSTS = 0xFFFFFFFF;
}

/*********************************************************************//**
* @brief 		Function to send command to Card interface unit (CIU)
* @param[in]	cmd Command with all flags set
* @param[in]	arg Argument for the command
* @return 		TRUE on times-out, otherwise FALSE
**********************************************************************/
static int prv_send_cmd(uint32_t cmd, uint32_t arg)
{
  volatile int tmo = 50;
  volatile int delay;

  /* set command arg reg*/
  LPC_SDMMC->CMDARG = arg;
  LPC_SDMMC->CMD = MCI_CMD_START | cmd;

  /* poll untill command is accepted by the CIU */
  while (--tmo && (LPC_SDMMC->CMD & MCI_CMD_START))
  {
    if (tmo & 1)
      delay = 50;
    else
      delay = 18000;

    while (--delay > 1);
  }

  return (tmo < 1) ? 1 : 0;
}

/*********************************************************************//**
* @brief 		Function to set speed of the clock going to card
* @param[in]	speed Clock speed
* @return 		TRUE on times-out, otherwise FALSE
**********************************************************************/
static void prv_set_clock(uint32_t speed)
{
  /* compute SD/MMC clock dividers */
  uint32_t div;

  div = ((sdio_clk_rate / speed) + 2) >> 1;

  if ((div == LPC_SDMMC->CLKDIV) && LPC_SDMMC->CLKENA)
    return; /* requested speed is already set */

  /* disable clock */
  LPC_SDMMC->CLKENA = 0;

  /* User divider 0 */
  LPC_SDMMC->CLKSRC = MCI_CLKSRC_CLKDIV0;

  /* inform CIU */
  prv_send_cmd(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

  /* set divider 0 to desired value */
  LPC_SDMMC->CLKDIV = MCI_CLOCK_DIVIDER(0, div);
  /* inform CIU */
  prv_send_cmd(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

  /* enable clock */
  LPC_SDMMC->CLKENA = MCI_CLKEN_ENABLE(0);
  /* inform CIU */
  prv_send_cmd(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);
}

/*********************************************************************//**
* @brief 		Function to retrieve command response
* @param[in]	pdev Pointer to card info structure
* @param[in]	length the length of the expected response, in bits
* @return 		None
**********************************************************************/
static void prv_pull_response(MCI_CARD_INFO_T* pdev, int length)
{
  /* on this chip response is not a fifo so read all 4 regs */
  pdev->response[0] = LPC_SDMMC->RESP0;
  pdev->response[1] = LPC_SDMMC->RESP1;
  pdev->response[2] = LPC_SDMMC->RESP2;
  pdev->response[3] = LPC_SDMMC->RESP3;
}

/*********************************************************************//**
* @brief 		Polls for command completion
* @param[in]	pdev Pointer to card info structure
* @param[in]	bit Status bits to poll for command completion
* @return 		0 on success, or failure condition (-1)
**********************************************************************/
static uint32_t prv_wait_for_completion(MCI_CARD_INFO_T* pdev, uint32_t bits)
{
  uint32_t status = 0;
  int tmo_count = US_TIMEOUT;

  /* also check error conditions */
  bits |= MCI_INT_EBE | MCI_INT_SBE | MCI_INT_HLE
          | MCI_INT_RTO | MCI_INT_RCRC | MCI_INT_RESP_ERR;

  if (bits & MCI_INT_DATA_OVER)
    bits |= MCI_INT_FRUN | MCI_INT_HTO | MCI_INT_DTO
            | MCI_INT_DCRC;

  if (pdev->wait_func == 0)
  {
    /* do busy polling when wait_func is not set*/
    do
    {
      TIM_Waitus(1);
      status = LPC_SDMMC->RINTSTS;

      if (--tmo_count < 1)
      {
        break;
      }
    }
    while ((status  & bits) == 0);
    /* set time out flag for driver timeout also */
    status |= ((tmo_count < 1) ? MCI_INT_RTO : 0);
  }
  else
  {
    /* call wait function set by application */
    status = pdev->wait_func(pdev, bits);
  }

  return status;
}

/*********************************************************************//**
* @brief 		Function to process the CSD & EXT-CSD of the card
* @param[in]	pdev Pointer to card info structure
* @return 		None
**********************************************************************/
static void prv_process_csd(MCI_CARD_INFO_T* pdev)
{
  int status = 0;
  int c_size = 0;
  int c_size_mult = 0;
  int mult = 0;

  /* compute block length based on CSD response */
  pdev->block_len = 1 << prv_get_bits(80, 83, pdev->csd);

  if ((pdev->card_type & CARD_TYPE_HC) &&
      (pdev->card_type & CARD_TYPE_SD))
  {
    /* See section 5.3.3 CSD Register (CSD Version 2.0) of SD2.0 spec
    an explanation for the calculation of these values
    */
    c_size = prv_get_bits(48, 63, (uint32_t*)pdev->csd) + 1;
    pdev->blocknr = c_size << 10; /* 512 byte blocks */
  }
  else
  {
    /* See section 5.3 of the 4.1 revision of the MMC specs for
    an explanation for the calculation of these values
    */
    c_size = prv_get_bits(62, 73, (uint32_t*)pdev->csd);
    c_size_mult = prv_get_bits(47, 49, (uint32_t*)pdev->csd); //csd_c_size_mult ();
    mult = 1 << (c_size_mult + 2);
    pdev->blocknr = (c_size + 1) * mult;
    /* adjust blocknr to 512/block */
    if (pdev->block_len > MMC_SECTOR_SIZE)
      pdev->blocknr = pdev->blocknr * (pdev->block_len >> 9);

    /* get extended CSD for newer MMC cards CSD spec >= 4.0*/
    if (((pdev->card_type & CARD_TYPE_SD) == 0) &&
        (prv_get_bits(122, 125, (uint32_t*)pdev->csd) >= 4))
    {
      /* put card in trans state */
      status = sdio_execute_command(pdev, CMD_SELECT_CARD, pdev->rca << 16, 0);
      /* set block size and byte count */
      LPC_SDMMC->BLKSIZ = MMC_SECTOR_SIZE;
      LPC_SDMMC->BYTCNT = MMC_SECTOR_SIZE;
      /* send EXT_CSD command */
	  sdio_dma_setup((uint32_t) pdev->ext_csd, MMC_SECTOR_SIZE);
      status = sdio_execute_command(pdev, CMD_SEND_EXT_CSD, 0, 0
                                   | MCI_INT_DATA_OVER);
      if ((status & MCI_INT_ERROR) == 0)
      {
        /* check EXT_CSD_VER is greater than 1.1 */
        if ((pdev->ext_csd[48] & 0xFF) > 1)
          pdev->blocknr = pdev->ext_csd[53]; /* bytes 212:215 represent sec count */

        /* switch to 52MHz clock if card type is set to 1 or else set to 26MHz */
        if ((pdev->ext_csd[49] & 0xFF) == 1)
        {
          /* for type 1 MMC cards high speed is 52MHz */
          pdev->speed = MMC_HIGH_BUS_MAX_CLOCK;
        }
        else
        {
          /* for type 0 MMC cards high speed is 26MHz */
          pdev->speed = MMC_LOW_BUS_MAX_CLOCK;
        }
      }
    }
  }

  pdev->device_size = pdev->blocknr << 9; /* blocknr * 512 */
}

/*********************************************************************//**
* @brief 		Puts current selected card in trans state
* @param[in]	pdev Pointer to card info structure
* @return 		0 on success, or error code (-1)
**********************************************************************/
static int prv_set_trans_state(MCI_CARD_INFO_T* pdev)
{
  uint32_t status;

  /* get current state of the card */
  status = sdio_execute_command(pdev, CMD_SEND_STATUS, pdev->rca << 16, 0);
  if (status & MCI_INT_RTO)
  {
    /* unable to get the card state. So return immediatly. */
    return -1;
  }
  /* check card state in response */
  status = R1_CURRENT_STATE(pdev->response[0]);
  switch (status)
  {
    case SDMMC_STBY_ST:
      /* put card in 'Trans' state */
      status = sdio_execute_command(pdev, CMD_SELECT_CARD, pdev->rca << 16, 0);
      if (status != 0)
      {
        /* unable to put the card in Trans state. So return immediatly. */
        return -1;
      }
      break;
    case SDMMC_TRAN_ST:
      /*do nothing */
      break;
    default:
      /* card shouldn't be in other states so return */
      return -1;
  }

#if SDIO_BUS_WIDTH > 1
  if (pdev->card_type & CARD_TYPE_SD)
  {
    sdio_execute_command(pdev, CMD_SD_SET_WIDTH, 2, 0);  /* SD, 4 bit width */
    /* if positive response */
    LPC_SDMMC->CTYPE = MCI_CTYPE_4BIT(0);
  }
#if SDIO_BUS_WIDTH > 4
#error 8-bit mode not supported yet!
#endif
#endif
  /* set block length */
  LPC_SDMMC->BLKSIZ = MMC_SECTOR_SIZE;
  status = sdio_execute_command(pdev, CMD_SET_BLOCKLEN, MMC_SECTOR_SIZE, 0);

