openxc/vi-firmware/cantranslator/libs/CDL/LPC18xxLib/src/lpc18xx_sdio.c
  /* Internal DMA setup for control register */
#ifdef SDIO_USE_POLLING
  LPC_SDMMC->CTRL = MCI_CTRL_USE_INT_DMAC;
#else
  LPC_SDMMC->CTRL = MCI_CTRL_USE_INT_DMAC | MCI_CTRL_INT_ENABLE;
  LPC_SDMMC->INTMASK = 0xFF<<16 | 0xFFFF;
#endif
  /* Clear the interrupts for the host controller */
  LPC_SDMMC->RINTSTS = 0xFFFFFFFF;

  /* Put in max timeout */
  LPC_SDMMC->TMOUT = 0xFFFFFFFF;

  /* FIFO threshold settings for DMA, DMA burst of 4,
     FIFO watermark at 16 */
  LPC_SDMMC->FIFOTH = (0x1 << 28) | (0xF << 16) | (0x10 << 0);

  /* Enable DMA, burst size of 4, fixed burst */
  LPC_SDMMC->BMOD = MCI_BMOD_DE | MCI_BMOD_PBL4 | MCI_BMOD_DSL(4);

  /* disable clock to CIU (needs latch) */
  LPC_SDMMC->CLKENA = 0;
  LPC_SDMMC->CLKSRC = 0;

  /* clear mmc structure*/
  memset(&g_card_info, 0, sizeof(MCI_CARD_INFO_T));
  /* set the wait_func if passed */
  g_card_info.wait_func = NULL;
  g_card_info.irq_callback = NULL;

	/* If not in polling mode, enable SDIO IRQ */
#ifndef SDIO_USE_POLLING
	NVIC_EnableIRQ(SDIO_IRQn);
#endif
}

/*********************************************************************//**
* @brief 		Detect if an SD card is inserted
* @param[in]	None
* @return 		Returns 1 if a card is detected, otherwise 0
**********************************************************************/
int sdio_card_detect(void)
{
	/* No card = high state in regsiter */
	if (LPC_SDMMC->CDETECT & 1)
		return 0;

	return 1;
}

/*********************************************************************//**
* @brief 		Detect if write protect is enabled
* @param[in]	None
* @return 		Returns 1 if card is write protected, otherwise 0
**********************************************************************/
int sdio_card_wp_on(void)
{
	if (LPC_SDMMC->WRTPRT & 1)
		return 1;

	return 0;
}

/*********************************************************************//**
* @brief 		Enable or disable slot power
* @param[in]	enable !0 to enable, or 0 to disable
* @return 		None
**********************************************************************/
void sdio_power_onoff(int enable)
{
	if (enable)
		LPC_SDMMC->PWREN = 1;
	else
		LPC_SDMMC->PWREN = 0;
}

/*********************************************************************//**
* @brief 		Get card's current state (idle, transfer, program, etc.)
* @param[in]	None
* @return 		Current transfer state (0 -
**********************************************************************/
int sdio_get_state(void)
{
  uint32_t status;

  /* get current state of the card */
  status = sdio_execute_command(&g_card_info, CMD_SEND_STATUS, g_card_info.rca << 16, 0);
  if (status & MCI_INT_RTO)
  {
    /* unable to get the card state. So return immediatly. */
    return -1;
  }
  /* check card state in response */
  return (int) R1_CURRENT_STATE(g_card_info.response[0]);
}

/*********************************************************************//**
* @brief 		Close the MCI
* @param[in]	None
* @return 		None
**********************************************************************/
void sdio_deinit(void)
{
  /* Place card in idle state */
  if (prv_card_acquired(&g_card_info) == 0)
    sdio_execute_command(&g_card_info, CMD_IDLE, 0, MCI_INT_CMD_DONE);

  /* clear mmc structure*/
  memset(&g_card_info, 0, sizeof(MCI_CARD_INFO_T));
  sdio_disable_clock();
}

/*********************************************************************//**
* @brief 		Performs the read of data from the SD/MMC card
* @param[in]	buffer    Pointer to data buffer to copy to
* @param[in]  	start_block Start block number
* @param[in]  	end_block End block number
* @return 		Bytes read, or 0 on error
**********************************************************************/
int sdio_read_blocks(void* buffer,
                     int start_block,
                     int end_block)
{
  MCI_CARD_INFO_T* pdev = &g_card_info;
  int cbRead = (end_block - start_block + 1) << 9; /*(end_block - start_block) * 512 */
  int status = 0;
  int index;

  /* if card is not acquired return immediately */
  if ((prv_card_acquired(pdev) == 0)
      || (end_block < start_block) /* check block index in range */
      || (start_block < 0)
      || (end_block > pdev->blocknr)
     )
  {
    return 0;
  }
  /* put card in trans state */
  if (prv_set_trans_state(pdev) != 0)
    return 0;

  /* set number of bytes to read */
  LPC_SDMMC->BYTCNT = cbRead;

  /* if high capacity card use block indexing */
  if (pdev->card_type & CARD_TYPE_HC)
    index = start_block;
  else
    index = start_block << 9;

  sdio_dma_setup((uint32_t) buffer, cbRead);

  /* check how many blocks to read */
  if (end_block ==  start_block)
  {
    status = sdio_execute_command(pdev, CMD_READ_SINGLE, index,
                                 0 | MCI_INT_DATA_OVER);
  }
  else
  {
    /* do read multiple */
    status = sdio_execute_command(pdev, CMD_READ_MULTIPLE, index,
                                 0 | MCI_INT_DATA_OVER);
  }

  if (status != 0)
    cbRead = 0; /* return error if command fails */

  return cbRead;
}

/*********************************************************************//**
* @brief 		Performs write of data to the SD/MMC card
* @param[in]	buffer    Pointer to data buffer to copy to
* @param[in]  	start_block Start block number
* @param[in]  	end_block End block number
* @return 		Number of bytes actually written, or 0 on error
**********************************************************************/
int sdio_write_blocks(void* buffer,
                      int start_block,
                      int end_block)
{
  MCI_CARD_INFO_T* pdev = &g_card_info;
  /*(end_block - start_block) * 512 */
  int cbWrote = (end_block - start_block + 1) << 9;
  int status;
  int index;

  /* if card is not acquired return immediately */
  if ((prv_card_acquired(pdev) == 0)
      || (end_block < start_block) /* check block index in range */
      || (start_block < 0)
      || (end_block > pdev->blocknr)
     )
  {
    return 0;
  }

  /* put card in trans state */
  if (prv_set_trans_state(pdev) != 0)
    return 0;

  /* set number of bytes to write */
  LPC_SDMMC->BYTCNT = cbWrote;

  /* if high capacity card use block indexing */
  if (pdev->card_type & CARD_TYPE_HC)
    index = start_block;
  else
    index = start_block << 9;

  sdio_dma_setup((uint32_t) buffer, cbWrote);

  /* check how many blocks to write */
  if (end_block == start_block)
  {
    status = sdio_execute_command(pdev, CMD_WRITE_SINGLE, index,
                                 0 | MCI_INT_DATA_OVER);
  }
  else
  {
    /* do write multiple */
    status = sdio_execute_command(pdev, CMD_WRITE_MULTIPLE, index,
                                 0 | MCI_INT_DATA_OVER);
  }

  if (status != 0)
	cbWrote = 0;

  return cbWrote;
}

/*********************************************************************//**
* @brief 		SDIO controller interrupt handler
* @param[in]	None
* @return 		None
**********************************************************************/
void SDIO_IRQHandler(void)
{
	if (g_card_info.irq_callback)
		g_card_info.irq_callback(&g_card_info, LPC_SDMMC->RINTSTS);
	LPC_SDMMC->RINTSTS = LPC_SDMMC->RINTSTS;
}
/**
 * @}
 */

#endif /* _SDIO */

/**
 * @}
 */
